app/controllers/tic_tac_toes_controller.rb

INSERT INTO "tic_tac_toes" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Fri, 21 Aug 2015 01:51:05 UTC +00:00], ["updated_at", Fri, 21 Aug 2015 01:51:05 UTC +00:00]]
---
  def create
    @tic_tac_toe = TicTacToe.create(t_params)

SELECT "tic_tac_toes".* FROM "tic_tac_toes" WHERE "tic_tac_toes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @tic_tac_toe = TicTacToe.find(params[:id])

SELECT "tic_tac_toes".* FROM "tic_tac_toes" WHERE "tic_tac_toes"."id" = ? LIMIT 1  [["id", "14"]]
---
  def pick
    @tic_tac_toe = TicTacToe.find(params[:id])